app/views/meals/_tag_fields.html.erb

SELECT "genres".* FROM "genres"
---
<div class="nested-fields">
    <%= f.collection_select :genre_id, Genre.all, :id, :genre_name ,:include_blank => "選択してください",class: "address-selec" %>