app/views/meals/index.html.erb


  <% if  Meal.where(user_id: current_user.id).present? %>
---
SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = ?  [["user_id", 1]]