app/views/posts/_index.html.erb

    <span class="cooking_list_item_image">
      <% if post.post_image.present? %>
---
SELECT "posts".* FROM "posts" WHERE (post_name LIKE '%炒飯%')