app/views/posts/show.html.erb

SELECT "flavors".* FROM "flavors" WHERE "flavors"."post_id" = ?  [["post_id", 1]]
---
          <h3 class="cooking-show_column_contents_title">調味料</h3>
          <% @post.flavors.each do |flavor| %>

SELECT "foodstuffs".* FROM "foodstuffs" WHERE "foodstuffs"."post_id" = ?  [["post_id", 1]]
---
          <h3 class="cooking-show_column_contents_title">材料</h3>
          <% @post.foodstuffs.each do |foodstuff| %>

SELECT "recipes".* FROM "recipes" WHERE "recipes"."post_id" = ?  [["post_id", 1]]
---
      <ol class="cooking-show_process_list">
        <% @post.recipes.each do |recipe| %>