app/controllers/genres_controller.rb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "cookings".* FROM "cookings" INNER JOIN "tags" ON "tags"."cooking_id" = "cookings"."id" WHERE "tags"."genre_id" = ? AND "cookings"."user_id" = ?  [["genre_id", 5], ["user_id", 1]]
---
  def show
    @genre = Genre.find(params[:id])
    # あるジャンルの中で自分のものだけを抽出
    @cookings = Cooking.joins(:tags).where(tags: { genre_id: @genre.id }, user_id: current_user.id).page(params[:page]).per(10)

INSERT INTO "genres" ("user_id", "genre_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["genre_name", "米"], ["created_at", "2022-01-15 02:50:16.026515"], ["updated_at", "2022-01-15 02:50:16.026515"]]
SELECT "genres".* FROM "genres"
---
  def create
    @genre = Genre.new(genre_params)
    @genre.user_id = current_user.id
    if @genre.save
      @genres = Genre.all