app/controllers/meals_controller.rb

  def index
    @meals = current_user.meals
    # 全体ランキング
    @genres = Genre.left_joins(:cookings).where(id: 1..13, cookings: { user_id: current_user.id}).group(:genre_id).order('count(genre_id) desc').limit(5)
    # 今月のランキング
    @genres_month = Genre.left_joins(cookings: :meal).where(id: 1..13, cookings: { user_id: current_user.id} ,meals: {date: Date.current.all_month}).group(:genre_id).order('count(genre_id) desc').limit(5)
    # 今週のランキング
    @genres_week = Genre.left_joins(cookings: :meal).where(id: 1..13, cookings: { user_id: current_user.id} ,meals: {date: Date.current.all_week}).group(:genre_id).order('count(genre_id) desc').limit(5)


    # 全体の割合
    @genres_bar = Genre.all.limit(13)
    # 今月の割合
    @genres_bar_month = Genre.left_joins(cookings: :meal).where(cookings: { user_id: current_user.id} ,meals: {date: Date.current.all_month}).includes(genre_name: nil).group(:genre_id).limit(13)
---
SELECT "genres"."genre_name" FROM "genres" INNER JOIN "tags" ON "tags"."genre_id" = "genres"."id" INNER JOIN "cookings" ON "cookings"."id" = "tags"."cooking_id" WHERE "cookings"."user_id" = ? GROUP BY "genre_id" ORDER BY count(genre_id) desc  [["user_id", 1]]