app/controllers/meals_controller.rb

  def index
    @meals = current_user.meals
    # 全体ランキング
    @genres = Genre.joins(:cookings).where(cookings: { user_id: current_user.id}).group(:genre_id).order('count(genre_id) desc').limit(5)
    # 今月のランキング
    @genres_month = Genre.joins(cookings: :meal).where(cookings: { user_id: current_user.id} ,meals: {date: Date.current.all_month}).group(:genre_id).order('count(genre_id) desc').limit(5)
    # 今週のランキング
    @genres_week = Genre.joins(cookings: :meal).where(cookings: { user_id: current_user.id} ,meals: {date: Date.current.all_week}).group(:genre_id).order('count(genre_id) desc').limit(5)
    # binding.pry
    @month = Genre.joins(:cookings).where(cookings: { user_id: current_user.id})

    # @gen = Genre.joins(:cookings).where(cookings: { user_id: current_user.id}).group(:genre_id).order('count(genre_id) desc').limit(5).pluck(:genre_name)
    @genres_pie = Genre.joins(:cookings).where(cookings: { user_id: current_user.id}).group(:genre_id).order('count(genre_id) desc')
---
SELECT  "genres".* FROM "genres" INNER JOIN "tags" ON "tags"."genre_id" = "genres"."id" INNER JOIN "cookings" ON "cookings"."id" = "tags"."cooking_id" INNER JOIN "tags" "tags_genres_join" ON "tags_genres_join"."genre_id" = "genres"."id" INNER JOIN "cookings" "cookings_genres_join" ON "cookings_genres_join"."id" = "tags_genres_join"."cooking_id" INNER JOIN "meals" ON "meals"."id" = "cookings_genres_join"."meal_id" WHERE "cookings"."user_id" = ? GROUP BY "genre_id" ORDER BY count(genre_id) desc LIMIT ?  [["user_id", 1], ["LIMIT", 5]]
SELECT COUNT(*) AS count_all, "genre_id" AS genre_id FROM "genres" INNER JOIN "tags" ON "tags"."genre_id" = "genres"."id" INNER JOIN "cookings" ON "cookings"."id" = "tags"."cooking_id" WHERE "cookings"."user_id" = ? GROUP BY "genre_id" ORDER BY count(genre_id) desc  [["user_id", 1]]
SELECT  "genres".* FROM "genres" INNER JOIN "tags" ON "tags"."genre_id" = "genres"."id" INNER JOIN "cookings" ON "cookings"."id" = "tags"."cooking_id" INNER JOIN "tags" "tags_genres_join" ON "tags_genres_join"."genre_id" = "genres"."id" INNER JOIN "cookings" "cookings_genres_join" ON "cookings_genres_join"."id" = "tags_genres_join"."cooking_id" INNER JOIN "meals" ON "meals"."id" = "cookings_genres_join"."meal_id" WHERE "cookings"."user_id" = ? AND "meals"."date" BETWEEN ? AND ? GROUP BY "genre_id" ORDER BY count(genre_id) desc LIMIT ?  [["user_id", 1], ["date", "2022-01-01"], ["date", "2022-01-31"], ["LIMIT", 5]]
SELECT COUNT(*) AS count_all, "genre_id" AS genre_id FROM "genres" INNER JOIN "tags" ON "tags"."genre_id" = "genres"."id" INNER JOIN "cookings" ON "cookings"."id" = "tags"."cooking_id" INNER JOIN "meals" ON "meals"."id" = "cookings"."meal_id" WHERE "cookings"."user_id" = ? AND "meals"."date" BETWEEN ? AND ? GROUP BY "genre_id" ORDER BY count(genre_id) desc  [["user_id", 1], ["date", "2022-01-01"], ["date", "2022-01-31"]]
SELECT  "genres".* FROM "genres" INNER JOIN "tags" ON "tags"."genre_id" = "genres"."id" INNER JOIN "cookings" ON "cookings"."id" = "tags"."cooking_id" WHERE "cookings"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 11]]
SELECT "genre" FROM "genres" INNER JOIN "tags" ON "tags"."genre_id" = "genres"."id" INNER JOIN "cookings" ON "cookings"."id" = "tags"."cooking_id" WHERE "cookings"."user_id" = ? GROUP BY "genre_id" ORDER BY count(genre_id) desc  [["user_id", 1]]

  def create
    @meal = Meal.new(meal_params)
    @meal.user_id = current_user.id
    # @meal.cookings.user_id = current_user.id
    # at_dates = Meal.where(date: @meal.date).select("mealtime: @meal.mealtime")
    at_dates = Meal.where(date: @meal.date, user_id: current_user.id).pluck(:mealtime)
    # dateにデータが入っていないか、同じ日に３回以内投稿されている

    unless at_dates.include?(@meal.mealtime)
       respond_to do |format|
        if @meal.save
---
SELECT "meals"."mealtime" FROM "meals" WHERE "meals"."date" = ? AND "meals"."user_id" = ?  [["date", "2022-01-11"], ["user_id", 2]]
SELECT "meals"."mealtime" FROM "meals" WHERE "meals"."date" = ? AND "meals"."user_id" = ?  [["date", "2022-01-16"], ["user_id", 1]]
INSERT INTO "meals" ("user_id", "title", "meal_description", "date", "mealtime", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @meal.user_id = current_user.id

      respond_to do |format|
        if @meal.update(meal_params)
---
UPDATE "meals" SET "title" = ?, "updated_at" = ? WHERE "meals"."id" = ?  [["title", "カルボナーラ"], ["updated_at", "2022-01-16 01:09:34.479440"], ["id", 5]]

  def destroy
    @meal.destroy
---
DELETE FROM "meals" WHERE "meals"."id" = ?  [["id", 9]]

  def day
    meals = Meal.joins(:cookings).select("meals.id,mealtime, title, meal_description, cookings.cooking_name ,cookings.url ,cookings.user_id").where(date: params[:day],user_id: current_user.id )
---
SELECT meals.id,mealtime, title, meal_description, cookings.cooking_name ,cookings.url ,cookings.user_id FROM "meals" INNER JOIN "cookings" ON "cookings"."meal_id" = "meals"."id" WHERE "meals"."date" = ? AND "meals"."user_id" = ?  [["date", "2021-12-14"], ["user_id", 1]]

    def set_meal
      @meal = Meal.find(params[:id])
---
SELECT  "meals".* FROM "meals" WHERE "meals"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]