app/controllers/meals_controller.rb

  def index
    @a = Meal.where(user_id: current_user.id)
---
SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = ?  [["user_id", 1]]