app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "post_name", "post_description", "post_image_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @posts = current_user.posts
    @post = Post.find(params[:id])