app/controllers/posts_controller.rb

  def index
    @posts = current_user.posts.page(params[:page]).per(40)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]