app/controllers/users_controller.rb

SELECT "cookings".* FROM "cookings" INNER JOIN "favorites" ON "cookings"."id" = "favorites"."cooking_id" WHERE "favorites"."user_id" = ?  [["user_id", 1]]
---
  def show
    @cookings = current_user.cookings.page(params[:page]).per(30)